/*
特殊回文数
问题描述
123321是一个非常特殊的数,它从左边读和从右边读是一样的
输入一个正整数n， 编程求所有这样的五位和六位十进制数,满足各位数字之和等于n
输入格式:
输入一行,包含一个正整数n
输出格式:
按从小到大的顺序输出满足条件的整数,每个整数占一行
样例输入:
52
样例输出:
899998
989989
998899
数据规模和约定
1<=n<=54
*/

#include<iostream>
using namespace std;
int main()
{
	int n;
	int a, b, c, t;
	cin >> n;
	for(a = 1; a < 10; a++)
		for(b = 0; b < 10; b++)
			for (c = 0; c < 10; c++)
			{
				if (a * 2 + b * 2 + c == n)
				{
					t = a * 10001 + b * 1010 + c * 100;
					cout << t << endl;
				}
			}
	for (a = 1; a < 10; a++)
		for (b = 0; b < 10; b++)
			for (c = 0; c < 10; c++)
			{
				if (a * 2 + b * 2 + c  *2 == n)
				{
					t = a * 100001 + b * 10010 + c * 1100;
					cout << t << endl;
				}
			}
	return 0;
}